Repository: MudassarAli10/taxi_meter-app
Catalog: lib/l10n/app_*.arb
Languages: fr

source: About Us
fr: À propos de nous

# test
source: Testimonials
fr: Témoignages

# history
source: History of my journeys
fr: Historique de mes trajets

source: Support
fr: Recommendations

# supportDes
source: If you have any questions or recommendations about the application, please send an email to support
fr: Si vous avez des questions ou des recommandations concernant l'application, veuillez envoyer un e-mail au support

# supportEmail
source: Email Us
fr: Envoyez-nous un courriel

# story
source: Our Story
fr: Notre histoire

# ourStory
source: In Casablanca, a tourist named Carla decides to take a taxi to visit the city. She hailed a taxi and eagerly climbed in. The driver, smiling, offered him a price that seemed reasonable. However, he began taking detours, showing her sights while increasing the meter. Absorbed in her stories, Carla did not notice the manipulation. Upon arrival, she was surprised by the exorbitant amount. While chatting with other tourists, she realized she had been scammed. Determined, she decided to share her experience through social networks to warn others and prevent them from falling into the same trap. This is where I decided to create Lynaro, a mobile application based on metering algorithms which allow me to give the exact price at the end of each journey.
fr: À Casablanca, une touriste nommée Carla décide de prendre un taxi pour visiter la ville. Elle héla un taxi et monta à bord avec impatience. Le chauffeur, souriant, lui proposa un tarif qui semblait raisonnable. Cependant, il commença à faire des détours, lui montrant des sites touristiques tout en augmentant le compteur. Absorbée par ses histoires, Carla ne remarqua pas la manipulation. À l’arrivée, elle fut surprise par le montant exorbitant. En discutant avec d'autres touristes, elle réalisa qu'elle avait été arnaquée. Déterminée, elle décida de partager son expérience à travers les réseaux sociaux pour avertir les autres et éviter qu’ils ne tombent dans le même piège. C’est là que je décide de créer Lynaro, une application mobile basée sur des algorithmes de métrage qui permettent de donner le prix exact à la fin de chaque trajet.

# mission
source: Our Mission
fr: Notre mission

# ourMission
source: Lynaro empowers passengers to enjoy a transparent and fair taxi experience. Our metering algorithm calculates the correct fare at the end of each ride, allowing passengers and drivers to agree on a fair price. Lynaro doesn't aim to replace cabs in Morocco, but to help passengers avoid scams and value honest drivers for safe, transparent journeys.
fr: Lynaro permet aux passagers de profiter d'une expérience de taxi transparente et équitable. Notre algorithme de comptage calcule le tarif correct à la fin de chaque trajet, permettant aux passagers et aux conducteurs de se mettre d'accord sur un prix équitable. Lynaro n’a pas pour but de remplacer les taxis au Maroc, mais d’aider les passagers à éviter les arnaques et à valoriser les chauffeurs honnêtes pour des trajets sûrs et transparents.

# use
source: How to Use Lynaro ?
fr: Comment utiliser Lynaro

# useto
source: 1. Start Lynaro when your cab driver begins the journey. 2. Allow the app to calculate the exact fare using our algorithm. 3. Upon arrival, Lynaro will display the accurate fare to pay. Lynaro, the app that guarantees fair and transparent rides, putting drivers' honesty first
fr: 1. Démarrez Lynaro lorsque votre chauffeur de taxi commence le trajet. 2. Autorisez l'application à calculer le tarif exact à l'aide de notre algorithme. 3. À votre arrivée, Lynaro affichera le tarif précis à payer. Lynaro, l’application qui garantit des trajets équitables et transparents, en mettant l’honnêteté des chauffeurs à l’honneur.

# destination
source: Enter Your Destination
fr: Entrez votre destination

# route
source: Get Route
fr: Obtenir l'itinéraire

# basePrice
source: Base Meter Price
fr: Prix de base du compteur

# setPrice
source: Add Price
fr: Ajouter le prix

source: Time
fr: Temps

# tripFinish
source: Trip Finished
fr: Voyage terminé

source: Price
fr: Prix

source: No Trip Yet
fr: Pas encore de voyage

source: Recent Trip
fr: Voyage récent

source: Where are you going?
fr: Où allez-vous ?

source: Choose Your Package
fr: Choisissez votre forfait

source: Save up to
fr: Économisez jusqu'à

# flexiblePayment
source: Flexible Payment Option
fr: Option de paiement flexible

source: Monthly
fr: Mensuel

source: Annual
fr: Annuel

source: Subscribe
fr: s'abonner

# whatIsLynaro
source: What is Lynaro and what is it used for?
fr: Qu’est-ce que Lynaro et à quoi sert-elle ?

# whatIsLynaroAnswer
source: Lynaro is an application designed to ensure a stress-free taxi journey. Thanks to an integrated counter, it allows you to check the real cost of the journey, thus avoiding frequent scams. It is designed specifically for the Moroccan context, but is also suitable for all those who travel by taxi in other countries.
fr: Lynaro est une application conçue pour assurer un trajet en taxi en toute sérénité. Grâce à un compteur intégré, elle permet de vérifier le coût réel du trajet, évitant ainsi les arnaques fréquentes. Elle est pensée spécifiquement pour le contexte marocain, mais convient également à tous ceux qui voyagent en taxis dans d’autres pays.

# howDoesTheLynaro
source: How does the Lynaro meter work?
fr: Comment fonctionne le compteur de Lynaro ?

# howDoesTheLynaroAnswer
source: Lynaro's meter uses GPS data to calculate the distance traveled and estimates the cost of the trip based on standard local rates. Simply start the counter at the start of the race and stop it at the end to get an accurate estimate.
fr: Le compteur de Lynaro utilise les données GPS pour calculer la distance parcourue et estime le coût du trajet en fonction des tarifs locaux standards. Il vous suffit de démarrer le compteur en début de course et de le stopper à la fin pour obtenir une estimation précise.

source: What is the base meter price?
fr: Qu’est-ce que le prix de base du compteur ?

# whatIsTheBaseMeterPriceAnswer
source: The base price corresponds to the initial amount displayed by the taxi meter at the start of the trip. For example, in Marrakech, the meter starts at 1.70 DH during the day. This starting price may vary depending on the city and time slots. Lynaro integrates this information to give you an accurate estimate of the cost of your trip.
fr: Le prix de base correspond au montant initial affiché par le compteur du taxi au début de la course. Par exemple, à Marrakech, le compteur démarre à 1,70 DH pendant la journée. Ce tarif de départ peut varier selon les villes et les plages horaires. Lynaro intègre ces informations pour vous offrir une estimation fidèle du coût de votre trajet.

# whatHappensUsingLynaro
source: What happens if the driver sees that I'm using Lynaro?
fr: Que se passe-t-il si le chauffeur voit que j’utilise Lynaro ?

# whatHappensUsingLynaroAnswer
source: A taxi is required by law to use its own meter. If his meter does not work, then he legally cannot work. If the driver refuses to allow you to use Lynaro during the trip, this may indicate that he intends to charge you an unjustified fare. Lynaro is here to ensure complete transparency and protect your rights as a passenger. If the driver has nothing to hide, he will have no problem using the application
fr: Un taxi est tenu par la loi d’utiliser son propre compteur. Si son compteur ne fonctionne pas, alors il ne peut légalement pas travailler. Si le chauffeur refuse que vous utilisiez Lynaro pendant le trajet, cela peut indiquer qu’il a l’intention de vous facturer un tarif injustifié. Lynaro est là pour garantir une transparence totale et protéger vos droits en tant que passager. Si le chauffeur n’a rien à cacher, il n’aura aucun problème avec l’utilisation de l’application.

# isLynaroAvailableInAllCities
source: Is Lynaro available in all cities in Morocco?
fr: Lynaro est-elle disponible dans toutes les villes du Maroc ?

# isLynaroAvailableInAllCitiesAnswer
source: Yes, Lynaro is available in all cities in Morocco. Whether you are in Casablanca, Marrakech, Tangier, Rabat or any other city, the application works to help you estimate the cost of your taxi trips. We are committed to providing a consistent and reliable experience, no matter where you are.
fr: Oui, Lynaro est disponible dans toutes les villes du Maroc. Que vous soyez à Casablanca, Marrakech, Tanger, Rabat ou dans toute autre ville, l’application fonctionne pour vous aider à estimer le coût de vos trajets en taxi. Nous nous engageons à offrir une expérience cohérente et fiable, peu importe où vous vous trouvez.

# errorMessage
source: Please enter a valid price (e.g., 1.70, 2.00).
fr: Veuillez entrer un prix valide (Ex : 1.70, 2.00 etc...)
